Revit 2027 API
EnergyDataSettings.SliverSpaceTolerance Property
 This property only applies if AnalysisType is RoomsOrSpaces. This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SliverSpaceTolerance { get; set; }
Public Property SliverSpaceTolerance As Double
	Get
	Set
public:
property double SliverSpaceTolerance {
	double get ();
	void set (double value);
}
member SliverSpaceTolerance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The sliver space tolerance is less than zero.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace